
{
  "product_name": "Dishwasher Detergent",
  "product_brand": "XYZ Clean",
  "product_image_url": "https://example.com/dishwasher_detergent.jpg",
  "boycotting_reason_details": "The Dishwasher Detergent by XYZ Clean leaves a residue on dishes, even after multiple rinses. It fails to effectively remove grease and food stains, resulting in unsatisfactory cleaning outcomes. Additionally, its strong chemical scent lingers on dishes, making them unpleasant to use. Switching to a natural, eco-friendly detergent not only ensures cleaner dishes but also promotes a healthier environment.",
  "query_title": "Seeking a more effective dishwasher detergent?"
  }
  
  {
  "product_name": "Shampoo",
  "product_brand": "Foamy Luxe",
  "product_image_url": "https://example.com/shampoo.jpg",
  "boycotting_reason_details": "Foamy Luxe Shampoo claims to offer hydration and shine but falls short in delivering on its promises. Users have reported that it leaves hair feeling dry and brittle, stripping away natural oils. Furthermore, its overpowering fragrance causes irritation to sensitive scalps. Transitioning to a sulfate-free, nourishing shampoo would result in healthier, more vibrant hair without the negative side effects.",
  "query_title": "Looking for a gentler shampoo alternative?"
  }
  
  {
  "product_name": "Face Moisturizer",
  "product_brand": "Glowy Skin",
  "product_image_url": "https://example.com/face_moisturizer.jpg",
  "boycotting_reason_details": "Glowy Skin Face Moisturizer claims to provide hydration and a radiant complexion, but its formula falls short for many users. It leaves a greasy residue on the skin, causing breakouts and clogged pores. Additionally, some have experienced allergic reactions due to its harsh chemical ingredients. Switching to a non-comedogenic, hypoallergenic moisturizer would prevent skin irritation and promote a healthier complexion.",
  "query_title": "In search of a non-greasy face moisturizer?"
  }
  
  {
  "product_name": "Energy Drink",
  "product_brand": "BoostUp",
  "product_image_url": "https://example.com/energy_drink.jpg",
  "boycotting_reason_details": "BoostUp Energy Drink claims to provide a quick energy boost, but its high sugar content and artificial additives pose health risks. Users have reported experiencing energy crashes shortly after consumption, along with increased heart palpitations and jitteriness. Moreover, its excessive caffeine content can lead to dependency and disrupted sleep patterns. Switching to natural energy alternatives like green tea or coconut water offers sustained energy without the adverse effects.",
  "query_title": "Seeking a healthier energy drink substitute?"
  }
  
  {
  "product_name": "Laundry Detergent",
  "product_brand": "FreshClean",
  "product_image_url": "https://example.com/laundry_detergent.jpg",
  "boycotting_reason_details": "FreshClean Laundry Detergent claims to provide a deep clean and lasting freshness, but many users have experienced adverse effects. It often fails to remove tough stains and leaves clothes with a strong chemical odor. Furthermore, its formula contains harsh ingredients that can irritate sensitive skin, leading to rashes and discomfort. Transitioning to a gentle, fragrance-free detergent ensures cleaner laundry without compromising on skin health.",
  "query_title": "In need of a gentler laundry detergent?"
  }
  
  {
  "product_name": "Toothpaste",
  "product_brand": "BrightSmile",
  "product_image_url": "https://example.com/toothpaste.jpg",
  "boycotting_reason_details": "BrightSmile Toothpaste promises whitening and cavity protection, but falls short on both fronts. Users have reported minimal improvement in teeth whitening, despite regular use. Additionally, it lacks fluoride, a crucial ingredient for cavity prevention, leaving teeth vulnerable to decay. Moreover, its strong mint flavor can cause sensitivity in some individuals. Switching to a fluoride-enriched toothpaste with proven whitening efficacy ensures optimal dental health and a brighter smile.",
  "query_title": "Seeking a more effective toothpaste for whitening?"
  }
  
  {
  "product_name": "Hand Sanitizer",
  "product_brand": "GermGuard",
  "product_image_url": "https://example.com/hand_sanitizer.jpg",
  "boycotting_reason_details": "GermGuard Hand Sanitizer claims to kill 99.9% of germs, but its formula may do more harm than good. Users have reported skin dryness and irritation after repeated use, attributed to its high alcohol content. Furthermore, some studies suggest that frequent use of alcohol-based sanitizers may lead to antibiotic resistance and disrupted skin microbiota. Switching to a moisturizing, alcohol-free sanitizer maintains hand hygiene without compromising skin health.",
  "query_title": "In search of a gentler hand sanitizer?"
  }
  
  {
  "product_name": "Microwave Popcorn",
  "product_brand": "PopAway",
  "product_image_url": "https://example.com/microwave_popcorn.jpg",
  "boycotting_reason_details": "PopAway Microwave Popcorn offers convenience but comes with health risks. Its microwave packaging contains perfluorooctanoic acid (PFOA), a chemical linked to adverse health effects including cancer and reproductive issues. Additionally, the artificial butter flavoring contains diacetyl, a compound known to cause respiratory problems. Switching to air-popped popcorn seasoned with natural herbs and spices provides a healthier alternative without sacrificing taste.",
  "query_title": "Seeking a safer alternative to microwave popcorn?"
  }